---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.RailProfileOpen
source: html/3dfea5d9-8b6c-cb57-c54f-cdc3ed9e92ab.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.RailProfileOpen Property

Open Profile Loop can't be used as a Rail Profile

## Syntax (C#)
```csharp
public static FailureDefinitionId RailProfileOpen { get; }
```